# OMZ Core Libraries
ohmyzsh/ohmyzsh path:lib

# OMZ Plugins
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/history
ohmyzsh/ohmyzsh path:plugins/gitignore
ohmyzsh/ohmyzsh path:plugins/direnv
ohmyzsh/ohmyzsh path:plugins/brew
ohmyzsh/ohmyzsh path:plugins/docker
ohmyzsh/ohmyzsh path:plugins/docker-compose
ohmyzsh/ohmyzsh path:plugins/gh
ohmyzsh/ohmyzsh path:plugins/kubectl

# External Plugins
zdharma-continuum/fast-syntax-highlighting
zsh-users/zsh-completions kind:fpath path:src

# Local Custom Plugins (Absolute paths)
${HOME}/.zsh/custom/plugins/brew-coreutils
${HOME}/.zsh/custom/plugins/gopath
${HOME}/.zsh/custom/plugins/ignore-completions
${HOME}/.zsh/custom/plugins/nix
${HOME}/.zsh/custom/plugins/nvim-nest
${HOME}/.zsh/custom/plugins/opam
${HOME}/.zsh/custom/plugins/skim
${HOME}/.zsh/custom/plugins/traildots

# run towards the BOTTOM of your .zsh_plugins.txt after fpath is populated
mattmc3/zephyr path:plugins/completion
