# External Plugins
zsh-users/zsh-completions kind:fpath path:src
zdharma-continuum/fast-syntax-highlighting
mroth/evalcache

# OMZ Plugins
ohmyzsh/ohmyzsh path:lib
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/history
ohmyzsh/ohmyzsh path:plugins/gitignore
ohmyzsh/ohmyzsh path:plugins/direnv
ohmyzsh/ohmyzsh path:plugins/brew
ohmyzsh/ohmyzsh path:plugins/docker
ohmyzsh/ohmyzsh path:plugins/docker-compose
ohmyzsh/ohmyzsh path:plugins/gh

# Local Custom Plugins (Absolute paths)
${HOME}/.zsh/custom/plugins/brew-coreutils
${HOME}/.zsh/custom/plugins/gopath
${HOME}/.zsh/custom/plugins/nix
${HOME}/.zsh/custom/plugins/ignore-completions
${HOME}/.zsh/custom/plugins/opam
${HOME}/.zsh/custom/plugins/nvim-nest
${HOME}/.zsh/custom/plugins/skim
${HOME}/.zsh/custom/plugins/nymphium
${HOME}/.zsh/custom/plugins/rcd
${HOME}/.zsh/custom/plugins/zoxide
${HOME}/.zsh/custom/plugins/git-tools
${HOME}/.zsh/custom/plugins/tmux

mattmc3/zephyr path:plugins/completion # run towards the bottom to cooperate with zsh-completions
mattmc3/zephyr path:plugins/color
mattmc3/zephyr path:plugins/history
